Revit 2026 API

# XYZZero Property

---

The coordinate origin or zero vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ Zero { get; }
```
```vb
Public Shared ReadOnly Property Zero As XYZ
	Get
```
```cpp
public:
static property XYZ^ Zero {
	XYZ^ get ();
}
```
```fsharp
static member Zero : XYZ with get
```

#### Property Value

XYZ

The zero vector is (0,0,0).

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace